#Дано целое число N (>2). Сформировать и вывести целочисленный список размера
#10, содержащий 10 первых элементов последовательности чисел Фибоначчи FK: F1
#= 1, F2 = 1, FK = FK-2 + FK-1, K = 3,4,...
def список(n):
    if n <= 0:
        return []
    список_фибоначчи = [1, 1]
    while len(список_фибоначчи) < n:
        следующее_число = список_фибоначчи[-1] + список_фибоначчи[-2]
        список_фибоначчи.append(следующее_число)
    return список_фибоначчи
N = 10
результат = список(N)
print(результат)