#2. Дан словарь с произвольным количеством элементов. Выяснить имеется ли в нем
#элемент с ключом «фрукт = яблоко» и если он отсутствует, то добавить его в словарь.
#Вывести на экран первоначальный словарь и измененный.

my_dict = {'овощ': 'помидор', 'ягода': 'клубника', 'напиток': 'сок'}
print("Первоначальный словарь:")
print(my_dict)
if 'фрукт' not in my_dict:
    my_dict['фрукт'] = 'яблоко'
print("\nИзмененный словарь:")
print(my_dict)
