#Дана строка-предложение на русском языке и число K (0 < K < 10). Зашифровать
#строку, выполнив циклическую замену каждой буквы на букву того же регистра,
#расположенную в алфавите на K-й позиции после шифруемой буквы (например, для
#K = 2 «А» перейдет в «В», «а» — в «в», «Б» — в «Г», «я» — в «б» и т. д.). Букву «ё»
# алфавите не учитывать, знаки препинания и пробелы не изменять.



a = 'абвгдежзийклмнопрстуфхцчшщъыьэюя'
A = 'АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'
k = int(input("число  "))
s = input("текст  ")
r = ""


for c in s:
    if c in a:
        i = a.find(c)
        n = (i + k) % len(a)
        r += a[n]
    elif c in A:
        i = A.find(c)
        n = (i + k) % len(A)
        r += A[n]
    else:
        r += c


print("Зашифрованный текст:", r)