#Вариант 5
#1. Выведите возраст из data = {'person': {'name': 'Alice', 'age': 30}}.

data = {'person': {'name': 'Alice', 'age': 30}}
age = data['person']['age']
print(f"Возраст: {age}")
